aix-qemu-how-to.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Fix issue in Maintenance mode</h2>
<div class="outline-text-2" id="text-6">
<p>
当最后一个 iso 文件恢复完成时，在 VirtualBox 中重新选择虚拟盘（第一个 iso 文件），
然后 boot 进入维护模式（Maintenance mode）：
<a id="boot-cdrom" name="boot-cdrom"></a>
</p>
<pre class="example">
# qemu-system-ppc64 -cpu POWER8 -machine pseries -m 2048 \
  -serial mon:stdio -drive file=rootvg.qcow2,if=none,id=drive-virtio-disk0 \
  -device virtio-scsi-pci,id=scsi -device scsi-hd,drive=drive-virtio-disk0 \
  -cdrom /dev/cdrom -prom-env boot-command='boot cdrom:'

## choose 3 (Start Maintenance Mode) --&gt; 1 (Access a Root VG) --&gt; 0 Continue
## --&gt; 1 (VG on hdisk0) --&gt; 1 (Access this VG and start a shell).
</pre>

<p>
首先由于编译优化的 QEMU 对于 ppc64 高地址存在寻址错误的情况，因此 <b>fsck</b> 在调用
<b>fsck64</b> 程序时可能造成系统启动卡住，因此在维护模式中我们需要手动修改 fsck64程序：
</p>
<pre class="example">
# cd /sbin/helpers/jfs2    &lt;--go to this location
# cp -p fsck64 fsck64.orig &lt;--backup
# &gt; fsck64                 &lt;--delete content of that file
# vi fsck64                &lt;--vi and insert these 2 lines. File is readonly, so save and quit with :w! and :q
#!/bin/ksh
exit 0

# cat fsck64               &lt;--it should contain 2 lines (#!/bin/ksh and exit 0)
# sync ; sync              &lt;--write cached memory to disk
</pre>

<p>
事实上最好还要修改相同路径下的 <b>logredo64</b> ，可以使用 <b>truss</b> 命令发现 fsck 过程
中卡在哪里并酌情更改相应的文件：
</p>
<div class="org-src-container">

<pre class="src src-sh">truss -f -a fsck 2&gt;&amp;1 | grep -u execv
</pre>
</div>

<p>
关闭不必要的启动服务：
</p>
<pre class="example">
lsitab -a
rmitab &lt;unnecessary-service&gt;
stopsrc -t tftpd
vi /etc/inetd.conf  # disable unnecessary services
vi /etc/rc.tcpip    # disable unnecessary services
vi /etc/filesystems # comment out some filesystems that do not exist
</pre>

<p>
记得重置 root 用户密码：
</p>
<div class="org-src-container">

<pre class="src src-sh">passwd root
sync; sync
halt -q
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Network setup</h2>
<div class="outline-text-2" id="text-7">
<p>
顺利的话，重新执行 <a href="#boot-cdrom">boot from cdrom</a> 我们可以进入到系统了，但是此时 AIX 虚拟机还没
有网卡，我们可以通过宿主机 CentOS 提供的 TAP（Terminal Access Point） 设备和
DNAT 技术来实现 ssh 隧道。首先我们要创建 TAP 设备，并将宿主机的真实网卡作为 ARP
proxy（软网关）：
</p>

<pre class="example">
# ip tuntap add tap0 mode tap
# ip link set tap0 up
# echo 1 &gt; /proc/sys/net/ipv4/conf/tap0/proxy_arp
# ip route add 10.0.2.16 dev tap0
# arp -Ds 10.0.2.16 enp0s3 pub
</pre>

<p>
接着我们将 TAP 设备作为 AIX 虚拟机的网卡启动：
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #f9b529;">cd</span> /aix &amp;&amp; <span style="color: #a9dc69;">\</span>
    qemu-system-ppc64 -cpu POWER8 -machine pseries -m 2048 -serial mon:stdio <span style="color: #a9dc69;">\</span>
                      -drive <span style="color: #8aa6bc;">file</span>=rootvg.qcow2,<span style="color: #8aa6bc;">if</span>=none,<span style="color: #8aa6bc;">id</span>=drive-virtio-disk0 <span style="color: #a9dc69;">\</span>
                      -device virtio-scsi-pci,<span style="color: #8aa6bc;">id</span>=scsi <span style="color: #a9dc69;">\</span>
                      -device scsi-hd,<span style="color: #8aa6bc;">drive</span>=drive-virtio-disk0 -cdrom /dev/cdrom <span style="color: #a9dc69;">\</span>
                      -prom-env boot-command=<span style="color: #a9dc69;">'boot cdrom:'</span> <span style="color: #a9dc69;">\</span>
                      -net nic,<span style="color: #8aa6bc;">macaddr</span>=56:44:45:30:31:32 -net tap,<span style="color: #8aa6bc;">script</span>=no,<span style="color: #8aa6bc;">ifname</span>=tap0
</pre>
</div>

<p>
注意 Guest 虚拟机的 MAC 地址是虚构的，不要使用 Host 上 tap0 设备的 MAC 地址。启
动之后，在 AIX 上配置 IP 地址：
</p>
<div class="org-src-container">

<pre class="src src-sh">chdev -l en0 -a <span style="color: #8aa6bc;">netaddr</span>=10.0.2.16 -a <span style="color: #8aa6bc;">netmask</span>=255.255.255.0 -a <span style="color: #8aa6bc;">state</span>=up
</pre>
</div>

<p>
此时可以从宿主机 CentOS ssh 到虚拟机了，但还不能从真正的外部 Windows 系统 ssh 到
AIX 虚拟机，我们还需要在 CentOS 上设置以下 DNAT：
</p>
<div class="org-src-container">

<pre class="src src-sh">sysctl -w net.ipv4.ip_forward=1
iptables -F -t nat
iptables -I INPUT -p tcp --dport 8022 -j ACCEPT
iptables -t nat -A PREROUTING -p tcp --dport 8022 -j DNAT --to-destination 10.0.2.16:22
iptables --line-numbers -n -L INPUT
iptables -t nat --line-numbers -n -L PREROUTING
</pre>
</div>
<p>
这样我们就将宿主机的 8022 端口重定向到 Guest 的 22 端口，再在 VirtualBox 的网络
设置中配置将 127.0.1.11:22 端口转发到 CentOS 的 enp0s3 所在的 10.0.2.15:8022 端
口，最后在 PuTTY 上直接访问 127.0.1.11:22 即可。注意，配置 TAP 设备以及 DNAT 操
作都将会在宿主机（CentOS）重启后失效，需要通过脚本或持久化配置优化。
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Restore the datavg</h2>
<div class="outline-text-2" id="text-8">
<p>
最后，我们需要恢复 datavg 的数据，这一步也有些曲折，原因还是出在 QEMU 上模拟的
ppc64 指令涉及到线程和高地址位总是有难以解决的问题，以最常见的 /usr/bin/ps 命令
为例，在 Guest 上运行将出现 segfault，分析生成的 core dump 将是如下错误：
</p>
<pre class="example">
# dbx /usr/bin/ps ./core
(dbx) where
.() at 0x3424
_global_trylock(??) at 0x900000000565cd4
_rec_mutex_trylock(??) at 0x9000000000317e0
...
</pre>
<p>
有人说编译 QEMU 时禁用优化选项可能可以解决 64 位寻址问题，因此我在<a href="#make-qemu">install qemu</a>建
议使用 -O0 编译选项，由于精力所限，如果可以 gdb 跟踪 QEMU 源代码，或许可以找到问
题的真正根源，为了绕过 ps 命令不可正确执行的问题，请使用 32 位ps 程序替代：
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #f9b529;">alias</span> <span style="color: #8aa6bc;">ps</span>=<span style="color: #a9dc69;">'/usr/sysv/bin/ps'</span>
</pre>
</div>

<p>
回到恢复 datavg 数据，正确但却无法实现的方法如下：
</p>
<div class="org-src-container">

<pre class="src src-sh">mkvgdata -X -x /tmp/fs.exclude datavg
<span style="color: #b2b2b2; font-style: italic;">## </span><span style="color: #696e92;">customize the /image.data, and /tmp/vgdata/datavg/datavg.data. Change the</span>
<span style="color: #b2b2b2; font-style: italic;">## </span><span style="color: #696e92;">PPSIZE and INLINE log.</span>
<span style="color: #b2b2b2; font-style: italic;">## </span><span style="color: #696e92;">Excludes files specified in the /etc/exclude.vgname</span>
savevg -e -f /export/mksysb/datavg.savevg datavg
</pre>
</div>

<p>
在宿主机建立 datavg 磁盘文件，并在启动时挂载：
</p>
<div class="org-src-container">

<pre class="src src-sh">qemu-img create -f qcow2 datavg.qcow2 150G

qemu-system-ppc64 -cpu POWER8 -machine pseries -m 2048 <span style="color: #a9dc69;">\</span>
                  -serial mon:stdio -device virtio-scsi-pci,<span style="color: #8aa6bc;">id</span>=scsi <span style="color: #a9dc69;">\</span>
                  -drive <span style="color: #8aa6bc;">file</span>=rootvg.qcow2,<span style="color: #8aa6bc;">if</span>=none,<span style="color: #8aa6bc;">id</span>=drive-virtio-disk0 <span style="color: #a9dc69;">\</span>
                  -device scsi-hd,<span style="color: #8aa6bc;">drive</span>=drive-virtio-disk0 <span style="color: #a9dc69;">\</span>
                  -drive <span style="color: #8aa6bc;">file</span>=datavg.qcow2,<span style="color: #8aa6bc;">if</span>=none,<span style="color: #8aa6bc;">id</span>=drive-virtio-disk1 <span style="color: #a9dc69;">\</span>
                  -device scsi-hd,<span style="color: #8aa6bc;">drive</span>=drive-virtio-disk1 <span style="color: #a9dc69;">\</span>
                  -cdrom /dev/cdrom -prom-env boot-command=<span style="color: #a9dc69;">'boot cdrom:'</span>
</pre>
</div>
<p>
注意 drive-id 和 device 一定要配对。如果要从 console detach 出来，请按 "~~."。
</p>

<p>
启动之后，将宿主机 datavg.savevg 所在目录共享给 Guest 作为 NFS：
</p>
<pre class="example">
## Run in CentOS
# setfacl -m u:65534:rwx /backups
# cat /etc/exports
/backups 10.0.2.0/24(rw,all_squash,sync,anonuid=65534,anongid=65534) *(ro)
# exportfs -arv

## Run in Guest
nfso -p -o nfs_use_reserved_ports=1 
mount 10.0.2.15:/backups /mnt
</pre>

<p>
然后在 Guest 上执行 restore：
</p>
<div class="org-src-container">

<pre class="src src-sh">restvg -f /mnt/datavg.savevg -P 128 hdisk1
</pre>
</div>

<p>
但是由于前述的原因，特别是 fsck 过程中的种种问题，这样是行不通的，需要手动创建
datavg，并先建立好文件系统之后（在Qemu 中推荐 JFS 文件系统，并且不要指定 INLINE
模式），再恢复相应文件：
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #696e92;">Create datavg</span>
mkvg -s 128 -y datavg hdisk1
chvg -a<span style="color: #a9dc69;">'n'</span> datavg

<span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #696e92;">Create FileSystems</span>
/usr/sbin/mklv -y<span style="color: #a9dc69;">'&lt;lv-name&gt;'</span> -t<span style="color: #a9dc69;">'jfs'</span> datavg 8
mkdir -p <span style="color: #a9dc69;">'&lt;mount-point&gt;'</span>
/usr/sbin/crfs -v jfs -d<span style="color: #a9dc69;">'&lt;lv-name&gt;'</span> -m<span style="color: #a9dc69;">'&lt;mount-point&gt;'</span> -A<span style="color: #a9dc69;">'no'</span> -p<span style="color: #a9dc69;">'rw'</span>

<span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #696e92;">Restore the files from vg-backup</span>
<span style="color: #f9b529;">cd</span> / &amp;&amp; listvgbackup -f<span style="color: #a9dc69;">'/mnt/datavg.savevg'</span> -r -s
</pre>
</div>

<p>
注意由于多层虚拟化的原因，I/O 的过程非常慢，当所有文件都恢复好之后，我们就要准备
启动 web 应用了。
</p>
</div>
</div>
