aix-qemu-how-to.org
* Start Apache
在启动 IBM HTTP Server 时我们再次遇到了高地址寻址错误，所以解决的方法是重新用 32
位编译 Apache 源程序，或者直接下载 32 位 RPM 包，当然你会发现似乎连 rpm(1) 命令
都可能卡住时，只能通过 verbose 选项检查其到底卡在何处，是否影响安装，如果出现rpm
数据库不一直的情况，请执行 *rpm --rebuilddb* 。最终我们还要修改 *httpd.conf*
（默认路径在 /opt/freeware/etc/httpd/conf/httpd.conf） 以及
一些 .html 文件以适配 Qemu 环境，当然运行 Vim 又会被卡在，这里推荐在 Guest 中安
装 Bellard 大神（QEMU的作者）的作品 [[https://bellard.org/qemacs/][QEmacs]]，编译和执行都飞快，Emacs 的基本功能和
字符集都支持得很好，而且 html-mode 非常实用（同样编译源代码时请不要开启编译优化，
大神的代码编译器不懂得优化...）。当全部就绪时，我们终于可以启动 Apache 了：
#+BEGIN_SRC sh
  /opt/freeware/sbin/apache start
#+END_SRC
当然不要忘记设置端口转发：
#+BEGIN_SRC sh
  iptables -I INPUT -p tcp --dport 8080 -j ACCEPT
  iptables -t nat -A PREROUTING -p tcp --dport 8080 -j DNAT --to-destination 10.0.2.16:80
#+END_SRC
在 VirtualBox 上设置端口转发（127.0.1.11:80 $\rightarrow$ 10.0.2.15:8080），
这样我们终于可以直接访问网页了。

* Miscellaneous
当一切准备就绪后，我们可以无需通过 cdrom 启动，并后台运行 AIX 虚拟机进程，再通过
网络连接：
#+BEGIN_SRC sh
  qemu-system-ppc64 -cpu POWER8 -machine pseries -m 2048 \
                    -device virtio-scsi-pci,id=scsi \
                    -drive file=rootvg.qcow2,if=none,id=drive-virtio-disk0 \
                    -device scsi-hd,drive=drive-virtio-disk0 \
                    -drive file=datavg.qcow2,if=none,id=drive-virtio-disk1 \
                    -device scsi-hd,drive=drive-virtio-disk1 \
                    -prom-env boot-command='boot disk:' \
                    -net nic,macaddr=56:44:45:30:31:32 -net tap,script=no,ifname=tap0 \
                    -daemonize

#+END_SRC

由于 AIX 虚拟机的
shutdown 脚本再调用其他命令时也存在高地址失效问题，因此重新启动 Guest 虚拟机，对
于 datavg 的文件系统，可能发生无法 mount 的情况，这种情况下，请指定从 cdrom 启动，
并进入维护模式，然后执行以下命令修复：

#+BEGIN_SRC sh
  redefinevg -d hdisk1 datavg
  varyonvg datavg
  synclvodm datavg
  chvg -a'n' datavg
#+END_SRC

从硬盘启动系统后，可以执行以下命令手动 mount 文件系统：
#+BEGIN_SRC sh
  varyonvg datavg
  lsvg -l datavg | awk '/closed/ {if ($NF !~ "N/A") system("mount "$NF)}'
#+END_SRC

因此在关闭系统前，也建议手动 umount 文件系统：
#+BEGIN_SRC sh
  lsvg -l datavg | awk '/open/ {if ($NF !~ "N/A") system("umount "$NF)}'
  varyoffvg datavg
#+END_SRC

另外，通过 cpio 可以针对目录的备份：
#+BEGIN_SRC sh
  # backup
  cd /path/of/folder && \
      find . -depth \( -type f -o -type l \) -mtime -7 -cpio /export/mksysb/folder.cpio

  # restore
  cpio -ivt </mnt/folder.cpio  # preview
  cpio -ivdm </mnt/folder.cpio
#+END_SRC
