aix-qemu-how-to.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Start Apache</h2>
<div class="outline-text-2" id="text-9">
<p>
在启动 IBM HTTP Server 时我们再次遇到了高地址寻址错误，所以解决的方法是重新用 32
位编译 Apache 源程序，或者直接下载 32 位 RPM 包，当然你会发现似乎连 rpm(1) 命令
都可能卡住时，只能通过 verbose 选项检查其到底卡在何处，是否影响安装，如果出现rpm
数据库不一直的情况，请执行 <b>rpm &#x2013;rebuilddb</b> 。最终我们还要修改 <b>httpd.conf</b>
（默认路径在 /opt/freeware/etc/httpd/conf/httpd.conf） 以及
一些 .html 文件以适配 Qemu 环境，当然运行 Vim 又会被卡在，这里推荐在 Guest 中安
装 Bellard 大神（QEMU的作者）的作品 <a href="https://bellard.org/qemacs/">QEmacs</a>，编译和执行都飞快，Emacs 的基本功能和
字符集都支持得很好，而且 html-mode 非常实用（同样编译源代码时请不要开启编译优化，
大神的代码编译器不懂得优化&#x2026;）。当全部就绪时，我们终于可以启动 Apache 了：
</p>
<div class="org-src-container">

<pre class="src src-sh">/opt/freeware/sbin/apache start
</pre>
</div>
<p>
当然不要忘记设置端口转发：
</p>
<div class="org-src-container">

<pre class="src src-sh">iptables -I INPUT -p tcp --dport 8080 -j ACCEPT
iptables -t nat -A PREROUTING -p tcp --dport 8080 -j DNAT --to-destination 10.0.2.16:80
</pre>
</div>
<p>
在 VirtualBox 上设置端口转发（127.0.1.11:80 \(\rightarrow\) 10.0.2.15:8080），
这样我们终于可以直接访问网页了。
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Miscellaneous</h2>
<div class="outline-text-2" id="text-10">
<p>
当一切准备就绪后，我们可以无需通过 cdrom 启动，并后台运行 AIX 虚拟机进程，再通过
网络连接：
</p>
<div class="org-src-container">

<pre class="src src-sh">qemu-system-ppc64 -cpu POWER8 -machine pseries -m 2048 <span style="color: #a9dc69;">\</span>
                  -device virtio-scsi-pci,<span style="color: #8aa6bc;">id</span>=scsi <span style="color: #a9dc69;">\</span>
                  -drive <span style="color: #8aa6bc;">file</span>=rootvg.qcow2,<span style="color: #8aa6bc;">if</span>=none,<span style="color: #8aa6bc;">id</span>=drive-virtio-disk0 <span style="color: #a9dc69;">\</span>
                  -device scsi-hd,<span style="color: #8aa6bc;">drive</span>=drive-virtio-disk0 <span style="color: #a9dc69;">\</span>
                  -drive <span style="color: #8aa6bc;">file</span>=datavg.qcow2,<span style="color: #8aa6bc;">if</span>=none,<span style="color: #8aa6bc;">id</span>=drive-virtio-disk1 <span style="color: #a9dc69;">\</span>
                  -device scsi-hd,<span style="color: #8aa6bc;">drive</span>=drive-virtio-disk1 <span style="color: #a9dc69;">\</span>
                  -prom-env boot-command=<span style="color: #a9dc69;">'boot disk:'</span> <span style="color: #a9dc69;">\</span>
                  -net nic,<span style="color: #8aa6bc;">macaddr</span>=56:44:45:30:31:32 -net tap,<span style="color: #8aa6bc;">script</span>=no,<span style="color: #8aa6bc;">ifname</span>=tap0 <span style="color: #a9dc69;">\</span>
                  -daemonize
</pre>
</div>

<p>
由于 AIX 虚拟机的
shutdown 脚本再调用其他命令时也存在高地址失效问题，因此重新启动 Guest 虚拟机，对
于 datavg 的文件系统，可能发生无法 mount 的情况，这种情况下，请指定从 cdrom 启动，
并进入维护模式，然后执行以下命令修复：
</p>

<div class="org-src-container">

<pre class="src src-sh">redefinevg -d hdisk1 datavg
varyonvg datavg
synclvodm datavg
chvg -a<span style="color: #a9dc69;">'n'</span> datavg
</pre>
</div>

<p>
从硬盘启动系统后，可以执行以下命令手动 mount 文件系统：
</p>
<div class="org-src-container">

<pre class="src src-sh">varyonvg datavg
lsvg -l datavg | awk <span style="color: #a9dc69;">'/closed/ {if ($NF !~ "N/A") system("mount "$NF)}'</span>
</pre>
</div>

<p>
因此在关闭系统前，也建议手动 umount 文件系统：
</p>
<div class="org-src-container">

<pre class="src src-sh">lsvg -l datavg | awk <span style="color: #a9dc69;">'/open/ {if ($NF !~ "N/A") system("umount "$NF)}'</span>
varyoffvg datavg
</pre>
</div>

<p>
另外，通过 cpio 可以针对目录的备份：
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #696e92;">backup</span>
<span style="color: #f9b529;">cd</span> /path/of/folder &amp;&amp; <span style="color: #a9dc69;">\</span>
    find . -depth <span style="color: #a9dc69;">\(</span> -type f -o -type l <span style="color: #a9dc69;">\)</span> -mtime -7 -cpio /export/mksysb/folder.cpio

<span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #696e92;">restore</span>
cpio -ivt &lt;/mnt/folder.cpio  <span style="color: #b2b2b2; font-style: italic;"># </span><span style="color: #696e92;">preview</span>
cpio -ivdm &lt;/mnt/folder.cpio
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: GongCun</p>
<p class="date">Created: 2020-07-13 Mon 08:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
